GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_uart.h
/******************************************************************************
*  Filename:       hw_uart.h
*  Revised:        2015-01-15 18:41:47 +0100 (to, 15 jan 2015)
*  Revision:       42400
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_UART_H__
#define __HW_UART_H__


//*****************************************************************************
//
// This section defines the register offsets of
// UART component
//
//*****************************************************************************
// UART Data
#define UART_O_DR                                                   0x00000000

// UART Error Clear Register
#define UART_O_ECR                                                  0x00000004

// UART Status Register
#define UART_O_RSR                                                  0x00000004

// UART Flag Register
#define UART_O_FR                                                   0x00000018

// UART Integer Baud-Rate Divisor
#define UART_O_IBRD                                                 0x00000024

// UART Fractional Baud-Rate Divisor
#define UART_O_FBRD                                                 0x00000028

// UART Line Control
#define UART_O_LCRH                                                 0x0000002C

// UART Control
#define UART_O_CTL                                                  0x00000030

// UART Interrupt FIFO Level Select
#define UART_O_IFLS                                                 0x00000034

// UART Interrupt Mask Set/Clear Register
#define UART_O_IMSC                                                 0x00000038

// Raw Interrupt Status Register
#define UART_O_RIS                                                  0x0000003C

// UART Masked Interrupt Status Register
#define UART_O_MIS                                                  0x00000040

// UART Interrupt Clear
#define UART_O_ICR                                                  0x00000044

// DMA Control Register
#define UART_O_DMACTL                                               0x00000048

//*****************************************************************************
//
// Register: UART_O_DR
//
//*****************************************************************************
// Field: [11]    OE
//
// UART Overrun Error:
// This bit is set to 1 if data is received and the receive FIFO is already
// full. The FIFO contents remain valid because no more data is written when the
// FIFO is full, , only the contents of the shift register are overwritten.
// This is cleared to 0 once there is an empty space in the FIFO and a new
// character can be written to it.
#define UART_DR_OE                                                  0x00000800
#define UART_DR_OE_BITN                                             11
#define UART_DR_OE_M                                                0x00000800
#define UART_DR_OE_S                                                11

// Field: [10]    BE
//
// UART Break Error:
// This bit is set to 1 if a break condition was detected, indicating that the
// received data input (UARTRXD input pin) was held LOW for longer than a full-word
// transmission time (defined as start, data, parity and stop bits).
// In FIFO mode, this error is associated with the character at the top of the
// FIFO (i.e., the oldest received data character since last read). When a break
// occurs, a 0 character is loaded into the FIFO. The next character is enabled
// after the receive data input (UARTRXD input pin) goes to a 1 (marking state), and
// the next valid start bit is received.
#define UART_DR_BE                                                  0x00000400
#define UART_DR_BE_BITN                                             10
#define UART_DR_BE_M                                                0x00000400
#define UART_DR_BE_S                                                10

// Field: [9]    PE
//
// UART Parity Error:
// When set to 1, it indicates that the parity of the received data character
// does not match the parity that the LCRH.EPS and LCRH.SPS select.
// In FIFO mode, this error is associated with the character at the top of the
// FIFO (i.e., the oldest received data character since last read).
#define UART_DR_PE                                                  0x00000200
#define UART_DR_PE_BITN                                             9
#define UART_DR_PE_M                                                0x00000200
#define UART_DR_PE_S                                                9

// Field: [8]    FE
//
// UART Framing Error:
// When set to 1, it indicates that the received character did not have a valid
// stop bit (a valid stop bit is 1).
// In FIFO mode, this error is associated with the character at the top of the
// FIFO (i.e., the oldest received data character since last read).
#define UART_DR_FE                                                  0x00000100
#define UART_DR_FE_BITN                                             8
#define UART_DR_FE_M                                                0x00000100
#define UART_DR_FE_S                                                8

// Field: [7:0] DATA
//
// Data transmitted or received:
// On writes, the transmit data character is pushed into the FIFO.
// On reads, the oldest received data character since the last read is returned.
#define UART_DR_DATA_M                                              0x000000FF
#define UART_DR_DATA_S                                              0

//*****************************************************************************
//
// Register: UART_O_ECR
//
//*****************************************************************************
// Field: [3]    OE
//
// The framing (FE), parity (PE), break (BE) and overrun (OE) errors are
// cleared to 0 by any write to this register.
#define UART_ECR_OE                                                 0x00000008
#define UART_ECR_OE_BITN                                            3
#define UART_ECR_OE_M                                               0x00000008
#define UART_ECR_OE_S                                               3

// Field: [2]    BE
//
// The framing (FE), parity (PE), break (BE) and overrun (OE) errors are
// cleared to 0 by any write to this register.
#define UART_ECR_BE                                                 0x00000004
#define UART_ECR_BE_BITN                                            2
#define UART_ECR_BE_M                                               0x00000004
#define UART_ECR_BE_S                                               2

// Field: [1]    PE
//
// The framing (FE), parity (PE), break (BE) and overrun (OE) errors are
// cleared to 0 by any write to this register.
#define UART_ECR_PE                                                 0x00000002
#define UART_ECR_PE_BITN                                            1
#define UART_ECR_PE_M                                               0x00000002
#define UART_ECR_PE_S                                               1

// Field: [0]    FE
//
// The framing (FE), parity (PE), break (BE) and overrun (OE) errors are
// cleared to 0 by any write to this register.
#define UART_ECR_FE                                                 0x00000001
#define UART_ECR_FE_BITN                                            0
#define UART_ECR_FE_M                                               0x00000001
#define UART_ECR_FE_S                                               0

//*****************************************************************************
//
// Register: UART_O_RSR
//
//*****************************************************************************
// Field: [3]    OE
//
// UART Overrun Error:
// This bit is set to 1 if data is received and the receive FIFO is already
// full. The FIFO contents remain valid because no more data is written when the
// FIFO is full, , only the contents of the shift register are overwritten.
// This is cleared to 0 once there is an empty space in the FIFO and a new
// character can be written to it.
#define UART_RSR_OE                                                 0x00000008
#define UART_RSR_OE_BITN                                            3
#define UART_RSR_OE_M                                               0x00000008
#define UART_RSR_OE_S                                               3

// Field: [2]    BE
//
// UART Break Error:
// This bit is set to 1 if a break condition was detected, indicating that the
// received data input (UARTRXD input pin) was held LOW for longer than a full-word
// transmission time (defined as start, data, parity and stop bits).
// When a break occurs, a 0 character is loaded into the FIFO. The next
// character is enabled after the receive data input (UARTRXD input pin) goes to a 1
// (marking state), and the next valid start bit is received.
#define UART_RSR_BE                                                 0x00000004
#define UART_RSR_BE_BITN                                            2
#define UART_RSR_BE_M                                               0x00000004
#define UART_RSR_BE_S                                               2

// Field: [1]    PE
//
// UART Parity Error:
// When set to 1, it indicates that the parity of the received data character
// does not match the parity that the LCRH.EPS and LCRH.SPS select.
#define UART_RSR_PE                                                 0x00000002
#define UART_RSR_PE_BITN                                            1
#define UART_RSR_PE_M                                               0x00000002
#define UART_RSR_PE_S                                               1

// Field: [0]    FE
//
// UART Framing Error:
// When set to 1, it indicates that the received character did not have a valid
// stop bit (a valid stop bit is 1).
#define UART_RSR_FE                                                 0x00000001
#define UART_RSR_FE_BITN                                            0
#define UART_RSR_FE_M                                               0x00000001
#define UART_RSR_FE_S                                               0

//*****************************************************************************
//
// Register: UART_O_FR
//
//*****************************************************************************
// Field: [7]    TXFE
//
// UART Transmit FIFO Empty:
// The meaning of this bit depends on the state of LCRH.FEN .
//   - If the FIFO is disabled, this bit is set when the transmit holding
// register is empty.
//   - If the FIFO is enabled, this bit is set when the transmit FIFO is empty.
// This bit does not indicate if there is data in the transmit shift register.
#define UART_FR_TXFE                                                0x00000080
#define UART_FR_TXFE_BITN                                           7
#define UART_FR_TXFE_M                                              0x00000080
#define UART_FR_TXFE_S                                              7

// Field: [6]    RXFF
//
// UART Receive FIFO Full:
// The meaning of this bit depends on the state of LCRH.FEN.
//   - If the FIFO is disabled, this bit is set when the receive holding
// register is full.
//   - If the FIFO is enabled, this bit is set when the receive FIFO is full.
#define UART_FR_RXFF                                                0x00000040
#define UART_FR_RXFF_BITN                                           6
#define UART_FR_RXFF_M                                              0x00000040
#define UART_FR_RXFF_S                                              6

// Field: [5]    TXFF
//
// UART Transmit FIFO Full:
// Transmit FIFO full. The meaning of this bit depends on the state of
// LCRH.FEN.
//   - If the FIFO is disabled, this bit is set when the transmit holding
// register is full.
//   - If the FIFO is enabled, this bit is set when the transmit FIFO is full.
#define UART_FR_TXFF                                                0x00000020
#define UART_FR_TXFF_BITN                                           5
#define UART_FR_TXFF_M                                              0x00000020
#define UART_FR_TXFF_S                                              5

// Field: [4]    RXFE
//
// UART Receive FIFO Empty:
// Receive FIFO empty. The meaning of this bit depends on the state of
// LCRH.FEN.
//   - If the FIFO is disabled, this bit is set when the receive holding
// register is empty.
//   - If the FIFO is enabled, this bit is set when the receive FIFO is empty.
#define UART_FR_RXFE                                                0x00000010
#define UART_FR_RXFE_BITN                                           4
#define UART_FR_RXFE_M                                              0x00000010
#define UART_FR_RXFE_S                                              4

