GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_uart.h
// Field: [3]    BUSY
//
// UART Busy:
// If this bit is set to 1, the UART is busy transmitting data. This bit remains
// set until the complete byte, including all the stop bits, has been sent from the
// shift register.
// This bit is set as soon as the transmit FIFO becomes non-empty, regardless of
// whether the UART is enabled or not.
#define UART_FR_BUSY                                                0x00000008
#define UART_FR_BUSY_BITN                                           3
#define UART_FR_BUSY_M                                              0x00000008
#define UART_FR_BUSY_S                                              3

// Field: [0]    CTS
//
// Clear To Send:
// This bit is the complement of the active-low UART CTS input pin.
// That is, the bit is 1 when CTS input pin is LOW.
#define UART_FR_CTS                                                 0x00000001
#define UART_FR_CTS_BITN                                            0
#define UART_FR_CTS_M                                               0x00000001
#define UART_FR_CTS_S                                               0

//*****************************************************************************
//
// Register: UART_O_IBRD
//
//*****************************************************************************
// Field: [15:0] DIVINT
//
// The integer baud rate divisor:
// The baud rate divisor is calculated using the formula below:
// Baud rate divisor = (UART reference clock frequency) / (16 * Baud rate)
// Baud rate divisor must be minimum 1 and maximum 65535.
// That is, DIVINT=0 does not give a valid baud rate.
// Similarly, if DIVINT=0xFFFF, any non-zero values in FBRD.DIVFRAC will be
// illegal.
// A valid value must be written to this field before the UART can be used for
// RX or TX operations.
//
#define UART_IBRD_DIVINT_M                                          0x0000FFFF
#define UART_IBRD_DIVINT_S                                          0

//*****************************************************************************
//
// Register: UART_O_FBRD
//
//*****************************************************************************
// Field: [5:0] DIVFRAC
//
// Fractional Baud-Rate Divisor:
// The baud rate divisor is calculated using the formula below:
// Baud rate divisor = (UART reference clock frequency) / (16 * Baud rate)
// Baud rate divisor must be minimum 1 and maximum 65535.
// That is, IBRD.DIVINT=0 does not give a valid baud rate.
// Similarly, if IBRD.DIVINT=0xFFFF, any non-zero values in DIVFRAC will be
// illegal.
// A valid value must be written to this field before the UART can be used for
// RX or TX operations.
//
#define UART_FBRD_DIVFRAC_M                                         0x0000003F
#define UART_FBRD_DIVFRAC_S                                         0

//*****************************************************************************
//
// Register: UART_O_LCRH
//
//*****************************************************************************
// Field: [7]    SPS
//
// UART Stick Parity Select:
//
// 0: Stick parity is disabled
// 1: The parity bit is transmitted and checked as invert of EPS field (i.e.
// the parity bit is transmitted and checked as 1 when EPS = 0).
//
// This bit has no effect when PEN disables parity checking and generation.
#define UART_LCRH_SPS                                               0x00000080
#define UART_LCRH_SPS_BITN                                          7
#define UART_LCRH_SPS_M                                             0x00000080
#define UART_LCRH_SPS_S                                             7

// Field: [6:5] WLEN
//
// UART Word Length:
// These bits indicate the number of data bits transmitted or received in a
// frame.
// ENUMs:
// 5                    Word Length 5 bits
// 6                    Word Length 6 bits
// 7                    Word Length 7 bits
// 8                    Word Length 8 bits
//
#define UART_LCRH_WLEN_M                                            0x00000060
#define UART_LCRH_WLEN_S                                            5
#define UART_LCRH_WLEN_5                                            0x00000000
#define UART_LCRH_WLEN_6                                            0x00000020
#define UART_LCRH_WLEN_7                                            0x00000040
#define UART_LCRH_WLEN_8                                            0x00000060

// Field: [4]    FEN
//
// UART Enable FIFOs
// ENUMs:
// DIS                  FIFOs are disabled (character mode) that is, the FIFOs
// become 1-byte-deep holding registers.
// EN                   Transmit and receive FIFO buffers are enabled (FIFO
// mode)
//
#define UART_LCRH_FEN                                               0x00000010
#define UART_LCRH_FEN_BITN                                          4
#define UART_LCRH_FEN_M                                             0x00000010
#define UART_LCRH_FEN_S                                             4
#define UART_LCRH_FEN_DIS                                           0x00000000
#define UART_LCRH_FEN_EN                                            0x00000010

// Field: [3]    STP2
//
// UART Two Stop Bits Select:
// If this bit is set to 1, two stop bits are transmitted at the end of the
// frame. The receive logic does not check for two stop bits being received.
#define UART_LCRH_STP2                                              0x00000008
#define UART_LCRH_STP2_BITN                                         3
#define UART_LCRH_STP2_M                                            0x00000008
#define UART_LCRH_STP2_S                                            3

// Field: [2]    EPS
//
// UART Even Parity Select
// ENUMs:
// ODD                  Odd parity: The UART generates or checks for an odd
// number of 1s in the data and parity bits.
// EVEN                 Even parity: The UART generates or checks for an even
// number of 1s in the data and parity bits.
//
#define UART_LCRH_EPS                                               0x00000004
#define UART_LCRH_EPS_BITN                                          2
#define UART_LCRH_EPS_M                                             0x00000004
#define UART_LCRH_EPS_S                                             2
#define UART_LCRH_EPS_ODD                                           0x00000000
#define UART_LCRH_EPS_EVEN                                          0x00000004

