GComPI-IFPB/openmote-fw/platform/cc2650/inc/hw_uart.h
// Field: [1]    PEN
//
// UART Parity Enable
// This bit controls generation and checking of parity bit.
//
// ENUMs:
// DIS                  Parity is disabled and no parity bit is added to the
// data frame
// EN                   Parity checking and generation is enabled.
//
#define UART_LCRH_PEN                                               0x00000002
#define UART_LCRH_PEN_BITN                                          1
#define UART_LCRH_PEN_M                                             0x00000002
#define UART_LCRH_PEN_S                                             1
#define UART_LCRH_PEN_DIS                                           0x00000000
#define UART_LCRH_PEN_EN                                            0x00000002

// Field: [0]    BRK
//
// UART Send Break
// If this bit is set to 1, a low-level is continually output on the UARTTXD
// output pin, after completing transmission of the current character. For the
// proper execution of the break command, the
// software must set this bit for at least two complete frames. For normal use,
// this bit must be cleared to 0.
#define UART_LCRH_BRK                                               0x00000001
#define UART_LCRH_BRK_BITN                                          0
#define UART_LCRH_BRK_M                                             0x00000001
#define UART_LCRH_BRK_S                                             0

//*****************************************************************************
//
// Register: UART_O_CTL
//
//*****************************************************************************
// Field: [15]    CTSEN
//
// CTS hardware flow control enable
// ENUMs:
// DIS                  CTS hardware flow control disabled
// EN                   CTS hardware flow control enabled
//
#define UART_CTL_CTSEN                                              0x00008000
#define UART_CTL_CTSEN_BITN                                         15
#define UART_CTL_CTSEN_M                                            0x00008000
#define UART_CTL_CTSEN_S                                            15
#define UART_CTL_CTSEN_DIS                                          0x00000000
#define UART_CTL_CTSEN_EN                                           0x00008000

// Field: [14]    RTSEN
//
// RTS hardware flow control enable
// ENUMs:
// DIS                  RTS hardware flow control disabled
// EN                   RTS hardware flow control enabled
//
#define UART_CTL_RTSEN                                              0x00004000
#define UART_CTL_RTSEN_BITN                                         14
#define UART_CTL_RTSEN_M                                            0x00004000
#define UART_CTL_RTSEN_S                                            14
#define UART_CTL_RTSEN_DIS                                          0x00000000
#define UART_CTL_RTSEN_EN                                           0x00004000

// Field: [11]    RTS
//
// Request to Send
// This bit is the complement of the active-low UART RTS output. That is, when
// the bit is programmed to a 1 then RTS output on the pins is LOW.
#define UART_CTL_RTS                                                0x00000800
#define UART_CTL_RTS_BITN                                           11
#define UART_CTL_RTS_M                                              0x00000800
#define UART_CTL_RTS_S                                              11

// Field: [9]    RXE
//
// UART Receive Enable
// If the UART is disabled in the middle of reception, it completes the current
// character before stopping.
// ENUMs:
// DIS                  UART Receive disabled
// EN                   UART Receive enabled
//
#define UART_CTL_RXE                                                0x00000200
#define UART_CTL_RXE_BITN                                           9
#define UART_CTL_RXE_M                                              0x00000200
#define UART_CTL_RXE_S                                              9
#define UART_CTL_RXE_DIS                                            0x00000000
#define UART_CTL_RXE_EN                                             0x00000200

// Field: [8]    TXE
//
// UART Transmit Enable
// If the UART is disabled in the middle of transmission, it completes the
// current character before stopping.
// ENUMs:
// DIS                  UART Transmit disabled
// EN                   UART Transmit enabled
//
#define UART_CTL_TXE                                                0x00000100
#define UART_CTL_TXE_BITN                                           8
#define UART_CTL_TXE_M                                              0x00000100
#define UART_CTL_TXE_S                                              8
#define UART_CTL_TXE_DIS                                            0x00000000
#define UART_CTL_TXE_EN                                             0x00000100

// Field: [7]    LBE
//
// UART Loop Back Enable:
// Enabling the loop-back mode connects the UARTTXD output from the UART to
// UARTRXD input of the UART.
// ENUMs:
// DIS                  Loop Back disabled
// EN                   Loop Back enabled
//
#define UART_CTL_LBE                                                0x00000080
#define UART_CTL_LBE_BITN                                           7
#define UART_CTL_LBE_M                                              0x00000080
#define UART_CTL_LBE_S                                              7
#define UART_CTL_LBE_DIS                                            0x00000000
#define UART_CTL_LBE_EN                                             0x00000080

// Field: [0]    UARTEN
//
// UART Enable
// ENUMs:
// DIS                  UART disabled
// EN                   UART enabled
//
#define UART_CTL_UARTEN                                             0x00000001
#define UART_CTL_UARTEN_BITN                                        0
#define UART_CTL_UARTEN_M                                           0x00000001
#define UART_CTL_UARTEN_S                                           0
#define UART_CTL_UARTEN_DIS                                         0x00000000
#define UART_CTL_UARTEN_EN                                          0x00000001

//*****************************************************************************
//
// Register: UART_O_IFLS
//
//*****************************************************************************
// Field: [5:3] RXSEL
//
// Receive interrupt FIFO level select:
// This field sets the trigger points for the receive interrupt. Values
// 0b101-0b111 are reserved.
// ENUMs:
// 1_8                  Receive FIFO becomes >= 1/8 full
// 2_8                  Receive FIFO becomes >= 1/4 full
// 4_8                  Receive FIFO becomes >= 1/2 full
// 6_8                  Receive FIFO becomes >= 3/4 full
// 7_8                  Receive FIFO becomes >= 7/8 full
//
#define UART_IFLS_RXSEL_M                                           0x00000038
#define UART_IFLS_RXSEL_S                                           3
#define UART_IFLS_RXSEL_1_8                                         0x00000000
#define UART_IFLS_RXSEL_2_8                                         0x00000008
#define UART_IFLS_RXSEL_4_8                                         0x00000010
#define UART_IFLS_RXSEL_6_8                                         0x00000018
#define UART_IFLS_RXSEL_7_8                                         0x00000020

// Field: [2:0] TXSEL
//
// Transmit interrupt FIFO level select:
// This field sets the trigger points for the transmit interrupt. Values
// 0b101-0b111 are reserved.
// ENUMs:
// 1_8                  Transmit FIFO becomes <= 1/8 full
// 2_8                  Transmit FIFO becomes <= 1/4 full
// 4_8                  Transmit FIFO becomes <= 1/2 full
// 6_8                  Transmit FIFO becomes <= 3/4 full
// 7_8                  Transmit FIFO becomes <= 7/8 full
//
#define UART_IFLS_TXSEL_M                                           0x00000007
#define UART_IFLS_TXSEL_S                                           0
#define UART_IFLS_TXSEL_1_8                                         0x00000000
#define UART_IFLS_TXSEL_2_8                                         0x00000001
#define UART_IFLS_TXSEL_4_8                                         0x00000002
#define UART_IFLS_TXSEL_6_8                                         0x00000003
#define UART_IFLS_TXSEL_7_8                                         0x00000004

//*****************************************************************************
//
// Register: UART_O_IMSC
//
//*****************************************************************************
// Field: [10]    OEIM
//
// Overrun error interrupt mask. A read returns the current mask for UART's overrun
// error interrupt. On a write of 1, the mask of the overrun error interrupt is set
// which means the interrupt state will be reflected in MIS.OEMIS. A write of 0
// clears the mask which means MIS.OEMIS will not reflect the interrupt.
#define UART_IMSC_OEIM                                              0x00000400
#define UART_IMSC_OEIM_BITN                                         10
#define UART_IMSC_OEIM_M                                            0x00000400
#define UART_IMSC_OEIM_S                                            10

// Field: [9]    BEIM
//
// Break error interrupt mask. A read returns the current mask for UART's break
// error interrupt. On a write of 1, the mask of the overrun error interrupt is set
// which means the interrupt state will be reflected in MIS.BEMIS. A write of 0
// clears the mask which means MIS.BEMIS will not reflect the interrupt.
#define UART_IMSC_BEIM                                              0x00000200
#define UART_IMSC_BEIM_BITN                                         9
#define UART_IMSC_BEIM_M                                            0x00000200
#define UART_IMSC_BEIM_S                                            9

// Field: [8]    PEIM
//
// Parity error interrupt mask. A read returns the current mask for UART's parity
// error interrupt. On a write of 1, the mask of the overrun error interrupt is set
// which means the interrupt state will be reflected in MIS.PEMIS. A write of 0
// clears the mask which means MIS.PEMIS will not reflect the interrupt.
#define UART_IMSC_PEIM                                              0x00000100
#define UART_IMSC_PEIM_BITN                                         8
#define UART_IMSC_PEIM_M                                            0x00000100
#define UART_IMSC_PEIM_S                                            8

// Field: [7]    FEIM
//
// Framing error interrupt mask. A read returns the current mask for UART's framing
// error interrupt. On a write of 1, the mask of the overrun error interrupt is set
// which means the interrupt state will be reflected in MIS.FEMIS. A write of 0
// clears the mask which means MIS.FEMIS will not reflect the interrupt.
#define UART_IMSC_FEIM                                              0x00000080
#define UART_IMSC_FEIM_BITN                                         7
#define UART_IMSC_FEIM_M                                            0x00000080
#define UART_IMSC_FEIM_S                                            7

// Field: [6]    RTIM
//
// Receive timeout interrupt mask. A read returns the current mask for UART's
// receive timeout interrupt. On a write of 1, the mask of the overrun error
// interrupt is set which means the interrupt state will be reflected in
// MIS.RTMIS. A write of 0 clears the mask which means this bitfield will not
// reflect the interrupt.
// The raw interrupt for receive timeout RIS.RTRIS cannot be set unless the
// mask is set (RTIM = 1). This is because the mask acts as an enable for power
// saving. That is, the same status can be read from MIS.RTMIS and RIS.RTRIS.
#define UART_IMSC_RTIM                                              0x00000040
#define UART_IMSC_RTIM_BITN                                         6
#define UART_IMSC_RTIM_M                                            0x00000040
#define UART_IMSC_RTIM_S                                            6

// Field: [5]    TXIM
//
// Transmit interrupt mask. A read returns the current mask for UART's transmit
// interrupt. On a write of 1, the mask of the overrun error interrupt is set which
// means the interrupt state will be reflected in MIS.TXMIS. A write of 0 clears
// the mask which means MIS.TXMIS will not reflect the interrupt.
#define UART_IMSC_TXIM                                              0x00000020
#define UART_IMSC_TXIM_BITN                                         5
#define UART_IMSC_TXIM_M                                            0x00000020
#define UART_IMSC_TXIM_S                                            5

// Field: [4]    RXIM
//
// Receive interrupt mask. A read returns the current mask for UART's receive
// interrupt. On a write of 1, the mask of the overrun error interrupt is set which
// means the interrupt state will be reflected in MIS.RXMIS. A write of 0 clears
// the mask which means MIS.RXMIS will not reflect the interrupt.
#define UART_IMSC_RXIM                                              0x00000010
#define UART_IMSC_RXIM_BITN                                         4
#define UART_IMSC_RXIM_M                                            0x00000010
#define UART_IMSC_RXIM_S                                            4

// Field: [1]    CTSMIM
//
// Clear to Send (CTS) modem interrupt mask. A read returns the current mask for
// UART's clear to send interrupt. On a write of 1, the mask of the overrun error
// interrupt is set which means the interrupt state will be reflected in
// MIS.CTSMMIS. A write of 0 clears the mask which means MIS.CTSMMIS will not
// reflect the interrupt.
#define UART_IMSC_CTSMIM                                            0x00000002
#define UART_IMSC_CTSMIM_BITN                                       1
#define UART_IMSC_CTSMIM_M                                          0x00000002
#define UART_IMSC_CTSMIM_S                                          1

//*****************************************************************************
//
// Register: UART_O_RIS
//
//*****************************************************************************
// Field: [10]    OERIS
//
// Overrun error interrupt status:
// This field returns the raw interrupt state of UART's overrun error interrupt.
// Overrun error occurs if data is received and the receive FIFO is full.
#define UART_RIS_OERIS                                              0x00000400
#define UART_RIS_OERIS_BITN                                         10
#define UART_RIS_OERIS_M                                            0x00000400
#define UART_RIS_OERIS_S                                            10

// Field: [9]    BERIS
//
// Break error interrupt status:
// This field returns the raw interrupt state of UART's break error interrupt.
// Break error is set when a break condition is detected, indicating that the
// received data input (UARTRXD input pin) was held LOW for longer than a full-word
// transmission time (defined as start, data, parity and stop bits).
#define UART_RIS_BERIS                                              0x00000200
#define UART_RIS_BERIS_BITN                                         9
#define UART_RIS_BERIS_M                                            0x00000200
#define UART_RIS_BERIS_S                                            9

// Field: [8]    PERIS
//
// Parity error interrupt status:
// This field returns the raw interrupt state of UART's parity error interrupt.
// Parity error is set if the parity of the received data character does not match
// the parity that the LCRH.EPS and LCRH.SPS select.
#define UART_RIS_PERIS                                              0x00000100
#define UART_RIS_PERIS_BITN                                         8
#define UART_RIS_PERIS_M                                            0x00000100
#define UART_RIS_PERIS_S                                            8

// Field: [7]    FERIS
//
// Framing error interrupt status:
// This field returns the raw interrupt state of UART's framing error interrupt.
// Framing error is set if the received character does not have a valid stop bit (a
// valid stop bit is 1).
#define UART_RIS_FERIS                                              0x00000080
#define UART_RIS_FERIS_BITN                                         7
#define UART_RIS_FERIS_M                                            0x00000080
#define UART_RIS_FERIS_S                                            7

// Field: [6]    RTRIS
//
// Receive timeout interrupt status:
// This field returns the raw interrupt state of UART's receive timeout
// interrupt. The receive timeout interrupt is asserted when the receive FIFO is not
// empty, and no more data is received during a 32-bit period. The receive timeout
// interrupt is cleared either when the FIFO becomes empty through reading all the
// data, or when a 1 is written to ICR.RTIC.
// The raw interrupt for receive timeout cannot be set unless the mask is set
// (IMSC.RTIM = 1). This is because the mask acts as an enable for power saving.
// That is, the same status can be read from MIS.RTMIS and RTRIS.
#define UART_RIS_RTRIS                                              0x00000040
#define UART_RIS_RTRIS_BITN                                         6
#define UART_RIS_RTRIS_M                                            0x00000040
#define UART_RIS_RTRIS_S                                            6

// Field: [5]    TXRIS
//
// Transmit interrupt status:
// This field returns the raw interrupt state of UART's transmit interrupt.
// When FIFOs are enabled (LCRH.FEN = 1), the transmit interrupt is asserted
// if the number of bytes in transmit FIFO is equal to or lower than the programmed
// trigger level (IFLS.TXSEL). The transmit interrupt is cleared by writing data
// to the transmit FIFO until it becomes greater than the trigger level, or by
// clearing the interrupt through ICR.TXIC.
// When FIFOs are disabled (LCRH.FEN = 0), that is they have a depth of one
// location, the transmit interrupt is asserted if there is no data present in the
// transmitters single location. It is cleared by performing a single write to the
// transmit FIFO, or by clearing the interrupt through ICR.TXIC.
#define UART_RIS_TXRIS                                              0x00000020
#define UART_RIS_TXRIS_BITN                                         5
#define UART_RIS_TXRIS_M                                            0x00000020
#define UART_RIS_TXRIS_S                                            5

// Field: [4]    RXRIS
//
// Receive interrupt status:
// This field returns the raw interrupt state of UART's receive interrupt.
// When FIFOs are enabled (LCRH.FEN = 1), the receive interrupt is asserted if
// the receive FIFO reaches the programmed trigger
// level (IFLS.RXSEL). The receive interrupt is cleared by reading data from
// the receive FIFO until it becomes less than the trigger level, or by clearing the
// interrupt through ICR.RXIC.
// When FIFOs are disabled (LCRH.FEN = 0), that is they have a depth of one
// location, the receive interrupt is asserted if data is received
// thereby filling the location. The receive interrupt is cleared by performing
// a single read of the receive FIFO, or by clearing the interrupt through
// ICR.RXIC.
#define UART_RIS_RXRIS                                              0x00000010
#define UART_RIS_RXRIS_BITN                                         4
#define UART_RIS_RXRIS_M                                            0x00000010
#define UART_RIS_RXRIS_S                                            4

// Field: [1]    CTSRMIS
//
// Clear to Send (CTS) modem interrupt status:
// This field returns the raw interrupt state of UART's clear to send interrupt.
#define UART_RIS_CTSRMIS                                            0x00000002
#define UART_RIS_CTSRMIS_BITN                                       1
#define UART_RIS_CTSRMIS_M                                          0x00000002
#define UART_RIS_CTSRMIS_S                                          1

//*****************************************************************************
//
// Register: UART_O_MIS
//
//*****************************************************************************
// Field: [10]    OEMIS
//
// Overrun error masked interrupt status:
// This field returns the masked interrupt state of the overrun interrupt which
// is the AND product of raw interrupt state RIS.OERIS and the mask setting
// IMSC.OEIM.
#define UART_MIS_OEMIS                                              0x00000400
#define UART_MIS_OEMIS_BITN                                         10
#define UART_MIS_OEMIS_M                                            0x00000400
#define UART_MIS_OEMIS_S                                            10

